{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "0",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 4,
            "content": "1",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 5,
            "content": "2",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 6,
            "content": "3",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 7,
            "content": "4",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 8,
            "content": "5",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 9,
            "content": "6",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 10,
            "content": "7",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 11,
            "content": "8",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 12,
            "content": "9",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "vocab": {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            "0": 3,
            "1": 4,
            "2": 5,
            "3": 6,
            "4": 7,
            "5": 8,
            "6": 9,
            "7": 10,
            "8": 11,
            "9": 12,
            "!": 13,
            "#": 14,
            "%": 15,
            "&": 16,
            "(": 17,
            ")": 18,
            "*": 19,
            "+": 20,
            ",": 21,
            ".": 22,
            "/": 23,
            ":": 24,
            ";": 25,
            "=": 26,
            ">": 27,
            "?": 28,
            "@": 29,
            "A": 30,
            "B": 31,
            "C": 32,
            "D": 33,
            "E": 34,
            "F": 35,
            "G": 36,
            "H": 37,
            "I": 38,
            "J": 39,
            "K": 40,
            "L": 41,
            "M": 42,
            "N": 43,
            "O": 44,
            "P": 45,
            "Q": 46,
            "R": 47,
            "S": 48,
            "T": 49,
            "U": 50,
            "V": 51,
            "W": 52,
            "X": 53,
            "Y": 54,
            "Z": 55,
            "[": 56,
            "]": 57,
            "_": 58,
            "a": 59,
            "b": 60,
            "c": 61,
            "d": 62,
            "e": 63,
            "f": 64,
            "g": 65,
            "h": 66,
            "i": 67,
            "j": 68,
            "k": 69,
            "l": 70,
            "m": 71,
            "n": 72,
            "o": 73,
            "p": 74,
            "q": 75,
            "r": 76,
            "s": 77,
            "t": 78,
            "u": 79,
            "v": 80,
            "w": 81,
            "x": 82,
            "y": 83,
            "z": 84,
            "£": 85,
            "°": 86,
            "³": 87,
            "µ": 88,
            "¼": 89,
            "À": 90,
            "Á": 91,
            "Â": 92,
            "Ã": 93,
            "Ç": 94,
            "È": 95,
            "É": 96,
            "Ê": 97,
            "Ì": 98,
            "Í": 99,
            "Ð": 100,
            "Ò": 101,
            "Ó": 102,
            "Ô": 103,
            "Ú": 104,
            "Ý": 105,
            "à": 106,
            "á": 107,
            "â": 108,
            "ã": 109,
            "ä": 110,
            "å": 111,
            "ç": 112,
            "è": 113,
            "é": 114,
            "ê": 115,
            "ì": 116,
            "í": 117,
            "î": 118,
            "ï": 119,
            "ð": 120,
            "ñ": 121,
            "ò": 122,
            "ó": 123,
            "ô": 124,
            "õ": 125,
            "ö": 126,
            "ù": 127,
            "ú": 128,
            "ü": 129,
            "ý": 130,
            "ā": 131,
            "Ă": 132,
            "ă": 133,
            "č": 134,
            "Đ": 135,
            "đ": 136,
            "Ĩ": 137,
            "ĩ": 138,
            "ł": 139,
            "ō": 140,
            "ş": 141,
            "Ũ": 142,
            "ũ": 143,
            "Ơ": 144,
            "ơ": 145,
            "Ư": 146,
            "ư": 147,
            "ə": 148,
            "̀": 149,
            "́": 150,
            "̂": 151,
            "̃": 152,
            "̆": 153,
            "̉": 154,
            "̛": 155,
            "̣": 156,
            "μ": 157,
            "Ạ": 158,
            "ạ": 159,
            "Ả": 160,
            "ả": 161,
            "Ấ": 162,
            "ấ": 163,
            "Ầ": 164,
            "ầ": 165,
            "Ẩ": 166,
            "ẩ": 167,
            "ẫ": 168,
            "Ậ": 169,
            "ậ": 170,
            "Ắ": 171,
            "ắ": 172,
            "ằ": 173,
            "ẳ": 174,
            "Ẵ": 175,
            "ẵ": 176,
            "ặ": 177,
            "ẹ": 178,
            "ẻ": 179,
            "ẽ": 180,
            "Ế": 181,
            "ế": 182,
            "Ề": 183,
            "ề": 184,
            "Ể": 185,
            "ể": 186,
            "ễ": 187,
            "Ệ": 188,
            "ệ": 189,
            "ỉ": 190,
            "Ị": 191,
            "ị": 192,
            "Ọ": 193,
            "ọ": 194,
            "ỏ": 195,
            "Ố": 196,
            "ố": 197,
            "Ồ": 198,
            "ồ": 199,
            "Ổ": 200,
            "ổ": 201,
            "ỗ": 202,
            "Ộ": 203,
            "ộ": 204,
            "Ớ": 205,
            "ớ": 206,
            "ờ": 207,
            "Ở": 208,
            "ở": 209,
            "ỡ": 210,
            "ợ": 211,
            "Ụ": 212,
            "ụ": 213,
            "Ủ": 214,
            "ủ": 215,
            "Ứ": 216,
            "ứ": 217,
            "Ừ": 218,
            "ừ": 219,
            "ử": 220,
            "ữ": 221,
            "Ự": 222,
            "ự": 223,
            "Ỳ": 224,
            "ỳ": 225,
            "ỵ": 226,
            "Ỷ": 227,
            "ỷ": 228,
            "Ỹ": 229,
            "ỹ": 230,
            "–": 231,
            "‘": 232,
            "’": 233,
            "“": 234,
            "”": 235,
            "…": 236,
            "⅔": 237,
            "≥": 238,
            "ng": 239,
            "nh": 240,
            "th": 241,
            "ch": 242,
            "tr": 243,
            "kh": 244,
            "ông": 245,
            "ph": 246,
            "gi": 247,
            "và": 248,
            "ên": 249,
            "iệ": 250,
            "ườ": 251,
            "là": 252,
            "iế": 253,
            "qu": 254,
            "ượ": 255
        },
        "merges": [
            "n g",
            "n h",
            "t h",
            "c h",
            "t r",
            "k h",
            "ô ng",
            "p h",
            "g i",
            "v à",
            "ê n",
            "i ệ",
            "ư ờ",
            "l à",
            "i ế",
            "q u",
            "ư ợ"
        ],
        "language": "vi"
    }
}