{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "0",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 4,
            "content": "1",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 5,
            "content": "2",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 6,
            "content": "3",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 7,
            "content": "4",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 8,
            "content": "5",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 9,
            "content": "6",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 10,
            "content": "7",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 11,
            "content": "8",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 12,
            "content": "9",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "vocab": {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            "0": 3,
            "1": 4,
            "2": 5,
            "3": 6,
            "4": 7,
            "5": 8,
            "6": 9,
            "7": 10,
            "8": 11,
            "9": 12,
            "!": 13,
            "#": 14,
            "%": 15,
            "&": 16,
            ",": 17,
            ".": 18,
            "/": 19,
            ":": 20,
            "?": 21,
            "A": 22,
            "B": 23,
            "C": 24,
            "D": 25,
            "E": 26,
            "F": 27,
            "G": 28,
            "H": 29,
            "I": 30,
            "J": 31,
            "K": 32,
            "L": 33,
            "M": 34,
            "N": 35,
            "O": 36,
            "P": 37,
            "Q": 38,
            "R": 39,
            "S": 40,
            "T": 41,
            "U": 42,
            "V": 43,
            "W": 44,
            "X": 45,
            "Y": 46,
            "Z": 47,
            "a": 48,
            "b": 49,
            "c": 50,
            "d": 51,
            "e": 52,
            "f": 53,
            "g": 54,
            "h": 55,
            "i": 56,
            "j": 57,
            "k": 58,
            "l": 59,
            "m": 60,
            "n": 61,
            "o": 62,
            "p": 63,
            "q": 64,
            "r": 65,
            "s": 66,
            "t": 67,
            "u": 68,
            "v": 69,
            "w": 70,
            "x": 71,
            "y": 72,
            "z": 73,
            "£": 74,
            "à": 75,
            "á": 76,
            "â": 77,
            "ã": 78,
            "è": 79,
            "é": 80,
            "ê": 81,
            "ì": 82,
            "í": 83,
            "ò": 84,
            "ó": 85,
            "ô": 86,
            "õ": 87,
            "ö": 88,
            "ù": 89,
            "ú": 90,
            "ü": 91,
            "ý": 92,
            "ă": 93,
            "đ": 94,
            "ĩ": 95,
            "ş": 96,
            "ũ": 97,
            "ơ": 98,
            "ư": 99,
            "̀": 100,
            "́": 101,
            "̃": 102,
            "̉": 103,
            "̣": 104,
            "ạ": 105,
            "ả": 106,
            "ấ": 107,
            "ầ": 108,
            "ẩ": 109,
            "ẫ": 110,
            "ậ": 111,
            "ắ": 112,
            "ằ": 113,
            "ẳ": 114,
            "ẵ": 115,
            "ặ": 116,
            "ẹ": 117,
            "ẻ": 118,
            "ẽ": 119,
            "ế": 120,
            "ề": 121,
            "ể": 122,
            "ễ": 123,
            "ệ": 124,
            "ỉ": 125,
            "ị": 126,
            "ọ": 127,
            "ỏ": 128,
            "ố": 129,
            "ồ": 130,
            "ổ": 131,
            "ỗ": 132,
            "ộ": 133,
            "ớ": 134,
            "ờ": 135,
            "ở": 136,
            "ỡ": 137,
            "ợ": 138,
            "ụ": 139,
            "ủ": 140,
            "ứ": 141,
            "ừ": 142,
            "ử": 143,
            "ữ": 144,
            "ự": 145,
            "ỳ": 146,
            "ỵ": 147,
            "ỷ": 148,
            "ỹ": 149,
            "–": 150,
            "ng": 151,
            "nh": 152,
            "th": 153,
            "ch": 154,
            "kh": 155,
            "tr": 156,
            "ông": 157,
            "ôi": 158,
            "là": 159,
            "và": 160,
            "ph": 161,
            "ườ": 162,
            "ủa": 163,
            "của": 164,
            "gi": 165,
            "có": 166,
            "ượ": 167,
            "tôi": 168,
            "ột": 169,
            "ên": 170,
            "không": 171,
            "một": 172,
            "ược": 173,
            "iệ": 174,
            "được": 175,
            "ất": 176,
            "đã": 177,
            "ới": 178,
            "đó": 179,
            "iế": 180,
            "ười": 181,
            "ấy": 182,
            "qu": 183,
            "đi": 184,
            "cá": 185,
            "nó": 186,
            "anh": 187,
            "người": 188,
            "ta": 189,
            "nà": 190,
            "ại": 191,
            "ều": 192,
            "ong": 193,
            "ạn": 194,
            "với": 195,
            "như": 196,
            "ây": 197,
            "sẽ": 198,
            "ình": 199,
            "uy": 200,
            "ến": 201,
            "để": 202,
            "thể": 203,
            "úng": 204,
            "đến": 205,
            "ững": 206,
            "ải": 207,
            "ngh": 208,
            "trong": 209,
            "cô": 210,
            "này": 211,
            "an": 212,
            "ần": 213,
            "ướ": 214,
            "cho": 215,
            "những": 216,
            "họ": 217,
            "cả": 218,
            "nói": 219,
            "gì": 220,
            "bạn": 221,
            "các": 222,
            "ân": 223,
            "làm": 224,
            "sự": 225,
            "ầu": 226,
            "ra": 227,
            "ác": 228,
            "uố": 229,
            "ai": 230,
            "ằng": 231,
            "on": 232,
            "iên": 233,
            "àn": 234,
            "ước": 235,
            "iết": 236,
            "ết": 237,
            "ơn": 238,
            "ời": 239,
            "ay": 240,
            "đây": 241,
            "chúng": 242,
            "ao": 243,
            "từ": 244,
            "ường": 245,
            "mà": 246,
            "ang": 247,
            "phải": 248,
            "ươ": 249,
            "khi": 250,
            "ho": 251,
            "điều": 252,
            "iện": 253,
            "về": 254,
            "ồi": 255
        },
        "merges": [
            "n g",
            "n h",
            "t h",
            "c h",
            "k h",
            "t r",
            "ô ng",
            "ô i",
            "l à",
            "v à",
            "p h",
            "ư ờ",
            "ủ a",
            "c ủa",
            "g i",
            "c ó",
            "ư ợ",
            "t ôi",
            "ộ t",
            "ê n",
            "kh ông",
            "m ột",
            "ượ c",
            "i ệ",
            "đ ược",
            "ấ t",
            "đ ã",
            "ớ i",
            "đ ó",
            "i ế",
            "ườ i",
            "ấ y",
            "q u",
            "đ i",
            "c á",
            "n ó",
            "a nh",
            "ng ười",
            "t a",
            "n à",
            "ạ i",
            "ề u",
            "o ng",
            "ạ n",
            "v ới",
            "nh ư",
            "â y",
            "s ẽ",
            "ì nh",
            "u y",
            "ế n",
            "đ ể",
            "th ể",
            "ú ng",
            "đ ến",
            "ữ ng",
            "ả i",
            "ng h",
            "tr ong",
            "c ô",
            "nà y",
            "a n",
            "ầ n",
            "ư ớ",
            "ch o",
            "nh ững",
            "h ọ",
            "c ả",
            "nó i",
            "g ì",
            "b ạn",
            "cá c",
            "â n",
            "là m",
            "s ự",
            "ầ u",
            "r a",
            "á c",
            "u ố",
            "a i",
            "ằ ng",
            "o n",
            "i ên",
            "à n",
            "ướ c",
            "iế t",
            "ế t",
            "ơ n",
            "ờ i",
            "a y",
            "đ ây",
            "ch úng",
            "a o",
            "t ừ",
            "ườ ng",
            "m à",
            "a ng",
            "ph ải",
            "ư ơ",
            "kh i",
            "h o",
            "đi ều",
            "iệ n",
            "v ề",
            "ồ i"
        ],
        "language": "vi"
    }
}